Repository: common-repository/recherche-multi-champs
Catalog: languages/recherche-multi-champs-*.po
Languages: fr_fr

source: Licence activation: Please try in a few moment
fr_fr: Activation de licence: S’il vous plaît essayer dans quelques instants

source: Your licence has expired, thank you for renewing it
fr_fr: Votre licence a expirée, merci de la renouveler

source: The licence is not associated to this domain
fr_fr: La licence n’est pas associée à ce domaine

source: Your licence has been deactivated
fr_fr: Votre licence a été désactivée

source: This licence key is unknown
fr_fr: Cette clé de licence est inconnue

source: Unknown error
fr_fr: Erreur inconnue

source: Numeric
fr_fr: Numérique

source: Text
fr_fr: Texte

source: Delete
fr_fr: Supprimer

source: Fields
fr_fr: Champs

source: Name
fr_fr: Nom

source: The name of the field
fr_fr: Le nom du champ

source: Choose the type "Numeric" to allow your visitors to search >=, <= or = at a number
fr_fr: Choisissez le type "Numeric" pour permettre à vos visiteurs de faire des recherches >=, <= ou = à un nombre

source: Cancel
fr_fr: Annuler

source: Add field
fr_fr: Ajouter un champ

source: Display fields in posts when calling shortcode [rmc_shortcode]
fr_fr: Afficher les champs dans les articles lors de l’appel au code court [rmc_shortcode]

source: Display fields in pages when calling shortcode [rmc_shortcode]
fr_fr: Afficher les champs dans les pages lors de l’appel au code court [rmc_shortcode]

source: Display fields in products when calling shortcode [rmc_shortcode]
fr_fr: Afficher les champs dans les produits lors de l’appel au code court [rmc_shortcode]

source: Display empty fields when calling shortcode [rmc_shortcode]
fr_fr: Afficher les champs vides lorsque vous appelez le code court [rmc_shortcode]

source: Display results for empty fields when calling shortcode [rmc_search_shortcode]
fr_fr: Afficher les résultats pour les champs vides lors de l’appel au code court [rmc_search_shortcode]

source: Delete all data on uninstall
fr_fr: Supprimer toutes les données lors de la désinstallation

source: Do not activate this setting if you want to install the premium version or if you want to keep your settings / fields for later
fr_fr: N’activez pas ce paramètre si vous souhaitez installer la version premium ou si vous souhaitez conserver vos paramètres / champs pour plus tard

source: Above
fr_fr: Au-dessus

source: Below
fr_fr: Au dessous

source: Licence key
fr_fr: Clé de licence

source: Licence key for premium version
fr_fr: Clé de licence pour la version premium

source: Color of form borders
fr_fr: Couleur des bordures du formulaire

source: Thickness of form borders
fr_fr: Épaisseur des bordures du formulaire

source: Thickness in pixels of form borders
fr_fr: Épaisseur en pixels des bordures du formulaire

source: Position of the results
fr_fr: Position des résultats

source: Position of the results in relation to the form
fr_fr: Position des résultats par rapport au formulaire

source: Update settings
fr_fr: Mettre à jour les réglages

source: How to use the plugin?
fr_fr: Comment utiliser le plugin?

source: 1. First of all
fr_fr: 1. Pour commencer

source: You have to create the fields you need. To do this, go to the Fields section and then on the right side of the screen. Enter the public name of the field, choose the type and click on the button to add the field
fr_fr: Vous devez créer les champs dont vous avez besoin. Pour ce faire, allez à la section Champs, puis sur le côté droit de l’écran. Entrez le nom public du champ, choisissez le type et cliquez sur le bouton pour ajouter le champ

source: If you want to allow your visitors to search with a larger or lower comparison on a numeric, choose the numeric type for your field
fr_fr: Si vous souhaitez permettre à vos visiteurs de rechercher avec une comparaison plus grande ou inférieure à un numérique, choisissez le type numérique pour votre champ

source: For example, we want to display a field relating to a brand. This will allow visitors to find information about their favorite brand in your posts, pages or directly find products from that brand.<br>So we create a field called "Famous Brand" with the type "Text":
fr_fr: Par exemple, nous voulons afficher un champ relatif à une marque. Cela permettra aux visiteurs de trouver des informations sur leur marque préférée dans vos articles, pages ou de trouver directement des produits de cette marque.<br>Nous créons donc un champ appelé "Famous Brand" avec le type "Texte":

source: 2. Fill-in the fields
fr_fr: 2. Remplir les champs

source: Now that the fields are created, you need to fill them in in your posts, pages or products. To do this, first check if the custom fields are displayed in your posts, pages and products: When you modify a post or a page, click on the button at the top right with the three vertical dots inside. Then choose "Options". Finally, click on "Custom fields" if it is not checked and accept the reload
fr_fr: Maintenant que les champs sont créés, vous devez les remplir dans vos articles, pages ou produits. Pour ce faire, vérifiez d’abord si les champs personnalisés sont affichés dans vos articles, pages et produits : lorsque vous modifiez un article ou une page, cliquez sur le bouton en haut à droite avec les trois points verticaux à l’intérieur. Ensuite, choisissez "Options". Enfin, cliquez sur "Champs personnalisés" si ce n’est pas coché et acceptez le rechargement

source: To enable custom fields in products, click on "Screen Options" button on the top of the screen when you edit a product and then check "Custom Fields"
fr_fr: Pour activer les champs personnalisés dans les produits, cliquez sur le bouton "Options d’écran" en haut de l’écran lorsque vous modifiez un produit, puis cochez "Champs personnalisés"

source: Now, for all your posts, pages and products, you have access to the custom fields at the bottom of the screen when you edit. Enter the value you want for each of them
fr_fr: Maintenant, pour tous vos articles, pages et produits, vous avez accès aux champs personnalisés au bas de l’écran lorsque vous les editez. Entrez la valeur que vous voulez pour chacun d’eux

source: 3. Display the fields
fr_fr: 3. Afficher les champs

source: This step is facultative. If you want to display the fields and associated values to your visitors for the posts, pages and products, you juste have to insert the following shortcode in them: [rmc_shortcode]
fr_fr: Cette étape est facultative. Si vous souhaitez afficher les champs et les valeurs associées à vos visiteurs pour les articles, les pages et les produits, vous devez simplement y insérer le code court suivant : [rmc_shortcode]

source: Then, the results of this shortcode will give something like this for your visitors:
fr_fr: Ensuite, ce code court donnera quelque chose comme ceci pour vos visiteurs:

source: 4. Insert the form
fr_fr: 4. Insérer le formulaire

source: Now that all your fields are ready, you can offer search forms to your visitors and filter the posts, pages and products with these fields. There are two ways to insert a search form:<br>- Insert a form in the widgets<br>- Insert a form with the shortcode [rmc_search_shortcode]
fr_fr: Maintenant que tous vos champs sont prêts, vous pouvez proposer des formulaires de recherche à vos visiteurs et ainsi leur permettre de filtrer les articles, les pages et les produits avec ces champs. Il y a deux façons d’insérer un formulaire de recherche :<br>- Insérer un formulaire dans les widgets<br>- Insérer un formulaire avec le code court [rmc_search_shortcode]

source: - Insert form in widget
fr_fr: - Insérer le formulaire dans un widget

source: Go to the wordpress menu "Appearance > Widgets" and look for the "Recherche Multi Champs" widget in the "Available widgets" section. Click on this widget, choose the sidebar / section you want for this widget, then click on the "Add widget" button. The widget appears on the right of the screen. You can then change its position and title if you wish
fr_fr: Accédez au menu wordpress "Apparence > Widgets" et recherchez le widget "Recherche Multi Champs" dans la section "Widgets disponibles". Cliquez sur ce widget, choisissez la barre latérale / section que vous voulez pour ce widget, puis cliquez sur le bouton "Ajouter widget". Le widget apparaît à droite de l’écran. Vous pouvez alors changer de position et de titre si vous le souhaitez

source: - Insert form with the shortcode [rmc_search_shortcode]
fr_fr: - Insérer le formulaire avec le code court [rmc_search_shortcode]

source: If you want to display the search form in a specific location, insert the shortcode [rmc_search_shortcode] in the post, page or product you want. You just copy/paste this shortcode like this:
fr_fr: Si vous souhaitez afficher le formulaire de recherche dans un endroit spécifique, insérez le code court [rmc_search_shortcode] dans l'article, la page ou le produit que vous souhaitez. Il suffit de copier / coller ce code court comme ceci:

source: 4. Customization
fr_fr: 4. Personnalisation

source: This step is optional. <br> - If you want to change the appearance or the position of the results, choose if the empty fields should be considered / displayed or not, go to the "Settings" section of the plugin and make the changes you want
fr_fr: Cette étape est facultative.<br>- Si vous souhaitez modifier l’apparence ou la position des résultats, choisir si les champs vides doivent être considérés / affichés ou non, allez à la section "Paramètres" du plugin et effectuez les modifications que vous souhaitez

source: - You can also change the size of the search form. To do this, you need to add an attribute to the shortcode like the examples below: <br> [rmc_search_shortcode size="50%"] <br> [rmc_search_shortcode size="250px"]
fr_fr: - Vous pouvez également modifier la taille du formulaire de recherche. Pour ce faire, vous devez ajouter un attribut au code court comme dans les exemples ci-dessous:<br>[rmc_search_shortcode size="50%"]<br>[rmc_search_shortcode size="250px"]

source: - If you have to redirect the search to a specific page, you can use the "action" attribute in the shortcode like this example:
fr_fr: - Si vous voulez rediriger la recherche vers une page spécifique, vous pouvez utiliser l’attribut « action » dans le code court comme dans cet exemple :

source: All results then will be displayed on page 2. Shortcode must be present on page 2
fr_fr: Tous les résultats seront alors affichés dans la page 2. Le code court doit être inséré obligatoirement dans la page 2

source: Settings
fr_fr: Paramètres

source: Help
fr_fr: Aide

source: All
fr_fr: Tout

source: Empty
fr_fr: Vide

source: Results per page
fr_fr: Résultats par page

source: Search
fr_fr: Rechercher

source: Search results
fr_fr: Résultats de recherche

source: No results for this search, please try again with less criteria.
fr_fr: Pas de résultats pour cette recherche, merci d'essayer à nouveau avec moins de critères.

source: Previous page
fr_fr: Page précédente

source: Next page
fr_fr: Page suivante

source: Move to trash
fr_fr: Déplacer à la corbeille

source: Update
fr_fr: Mettre à jour

source: Info bar. Displays information when you edit a field
fr_fr: Barre d’information. Affiche les informations lorsque vous modifiez un champ

source: See the details below in the info bar
fr_fr: Voir les détails ci-dessous dans la barre d’information

source: Are you sure you want to delete this item?
fr_fr: Êtes-vous sûr(e) de bien vouloir supprimer cet élément ?

source: Please fill in the label
fr_fr: Veuillez remplir le label

source: Please fill in the maximum quantity
fr_fr: Veuillez remplir la quantité maximum

source: Please fill in the end date
fr_fr: Veuillez remplir la date de fin

source: Search via custom fields
fr_fr: Rechercher via des champs personnalisés

source: Title:
fr_fr: Titre:

source: Créer vos propres champs pour vos articles/pages et proposer une recherche basée sur ces champs à vos visiteurs.
fr_fr: Créer vos propres champs pour vos articles/pages et proposer une recherche sur ces champs à vos visiteurs.
